{
  "architectures": [
    "XLNetLMHeadModel"
  ],
  "attn_type": "bi",
  "bi_data": false,
  "clamp_len": -1,
  "d_inner": 2048,
  "d_model": 512,
  "dropout": 0.1,
  "end_n_top": 5,
  "ff_activation": "gelu",
  "initializer_range": 0.02,
  "language": "aas",
  "layer_norm_eps": 1e-12,
  "model_type": "xlnet",
  "n_head": 16,
  "n_layer": 24,
  "numerical_encodings_dim": 16,
  "numerical_encodings_format": "sum",
  "numerical_encodings_type": "float",
  "pad_token_id": 0,
  "same_length": false,
  "start_n_top": 5,
  "summary_activation": "tanh",
  "summary_last_dropout": 0.1,
  "summary_type": "last",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 250
    }
  },
  "untie_r": true,
  "output_hidden_states": true,
  "use_numerical_encodings": false,
  "vmax": 1.0,
  "vocab_size": 306
}
